# 다른 사람 풀이 아이디어 참고
def solution(clothes):
    dic = {k:[] for v,k in clothes}
    for cloth in clothes:
        dic[cloth[1]].append(cloth[0])
    
    cb = 1
    for v in dic.values():
        cb *= (len(v)+1)
    
    return cb-1

'''
# 풀이 아이디어
가능한 옷 입는 조합 모두 찾기 
ex) 상의: [반팔, 긴팔, 니트] 
    하의: [청바지, 카고바지, 추리닝]
    겉옷: [트렌치코트, 바람막이]
    위와 같은 의상이 존재한다면, 문제의 조건에서는 같은 종류의 옷에서는 한가지만 착용 가능하고, 무조건 옷은 1개이상 입어야 한다고 했으므로
    상의: [미착용, 반팔, 긴팔, 니트] -> 3가지
    하의: [미착용, 청바지, 카고바지, 추리닝] -> 4가지
    겉옷: [미착용, 트렌치코트, 바람막이] => 3가지
    total 경우의 수 : 3 * 4 * 3 = 36가지
    여기서 total 경우의 수에는 상의, 하의, 겉옷 모두 미착용 한 경우가 포함되어 있으므로, 이를 제외한 total - 1 이 가능한 옷 입는 조합의 경우의 수가 된다.
    따라서, 정답은 total - 1 이다.
'''